** Local State Variables  

#+BEGIN_SRC scheme
(define balance 100)

(define (withdraw amount)
  (if (>= balance amount)
      (begin (set! balance (- balance amount)) balance)
      "Insufficient Funds"))

(withdraw 20)
(withdraw 25)
(withdraw 50)
(withdraw 6)
#+END_SRC

#+RESULTS:

We can make balance internal to withdraw by rewriting the procedure as follows:

#+BEGIN_SRC scheme
(define new-withdraw
  (let ((balance 100))
    (lambda (amount)
      (if (>= balance amount)
          (begin (set! balance (- balance amount))
                 balance)
          "Insufficient Funds"))))

(define new-withdraw-2
  (let ((balance 100))
    withdraw))

(new-withdraw 20)
(new-withdraw-2 20) 
#+END_SRC

#+RESULTS:
: Insufficient Funds

Within this local environment, we use lambda to create a procedure that takes amount as an argument and behaves like our previous withdraw procedure. This procedure, returned as a result of evaluating the let expression behaves in precisely the same way as withdraw, but whose variable balance is not accessible by any other procedure. 

The variable balance is said to be encapsulated within the new procedure. This principle is known as the hiding principle: One can make a system more modular and robust by protecting parts of the system from each other. 

The following procedure, make-withdraw, creates "withdrawl processors".

#+BEGIN_SRC scheme
(define (make-withdraw balance)
  (lambda (amount)
    (if (>= balance amount)
        (begin (set! balance (- balance amount))
               balance)
        "Insufficient Funds")))

(define W1 (make-withdraw 100))
(define W2 (make-withdraw 100))

(W1 50)
(W2 70)
#+END_SRC

#+RESULTS:
: 30

Observe that W1 and W2 are completely independent objects, each with its own local state variable balance. 

We can also create objects that handle deposits as well as withdrawls, and thus represent simple bank accounts. 

#+BEGIN_SRC scheme
(define (make-account balance)
  (define (withdraw amount)
    (if (>= balance amount)
        (begin (set! balance (- balance amount))
               balance)
        "Insufficient Funds"))
  (define (deposit amount)
    (set! balance (+ balance amount))
    balance)
  (define (dispatch m)
    (cond ((eq? m 'withdraw) withdraw)
          ((eq? m 'deposit) deposit)
          (else (error "Unknown Request: MAKE-ACCOUNT" m))))
  dispatch)
#+END_SRC

#+RESULTS:
: make-account

Each call to make-account sets up an environment with a local state variable balance. Within this environment, make-account defines procedures deposit and withdraw that access balance and an additional procedure dispatch that takes a message as input and returns one of the two local procedures. The dispatch procedure is returned as the value that represents the bank-account object. This is the message-passing style of programming that we saw earlier, although now we are using it in conjunction with the ability to modify local variables. 

#+BEGIN_SRC scheme
(define acc (make-account 100))

((acc 'withdraw) 50)
((acc 'deposit) 20)
((acc 'withdraw) -10)
#+END_SRC

#+RESULTS:
: 80

*** Exercise 3.1 

An accumulator is a procedure that is called repeatedly with a single numeric argument and accumulates its arguments into a sum. Each time it is called it returns the currently accumulated sum. Write a procedure make-accumulator that generates accumulators, each maintaining an independent sum. The input to make-accumulator should specify the initial value of the sum.

#+BEGIN_SRC scheme
(define (make-accumulator start)
  (lambda (add)
    (set! start (+ start add))
    start))

(define (reset-accumulator acc)
  (acc (- (acc 0))))

(define howdy (make-accumulator 0))

(reset-accumulator howdy)

(howdy 1)
(howdy (- (howdy 0)))
(howdy 1)
#+END_SRC

#+RESULTS:
: 0

